alvin233/F407_uCOSIII_191021/Examples/ST/STM32F429II-SK/OS3/w5500.c
#include "stm32f4xx.h"
#include "stm32f4xx_spi.h"				
#include "W5500.h"	
#define   BSP_MODULE
#include  <bsp.h>
#include  <os.h>
#include <string.h>
/**********************************************************************************
 * File name : W5500.c
 * Description   : driver      
 * Version : ST_v3.5

 * Link : http://yixindianzikeji.taobao.com/
**********************************************************************************/


/***************----- Network parameter definition -----***************/
/* gate way IP address */ 
unsigned char Gateway_IP[4];
/* submask ip address */
unsigned char Sub_Mask[4];	
/* MAC address */
unsigned char Phy_Addr[6];	
/* self IP address */ 
unsigned char IP_Addr[4];	 
/* port number of W5500's port 0 */
unsigned char S0_Port[2];	
/* port 0 of W5500's destination IP */
unsigned char S0_DIP[4];	
/* port 0 of W5500's destination port */
unsigned char S0_DPort[2];	
/* UDP broadcast mode, destination IP address */
unsigned char UDP_DIPR[4];	
/* UDP broadcast mode, destination IP port */
unsigned char UDP_DPORT[2];	

/**********************************************************************************
 * S0_Mode, port 0 operation mode
 * S0_Mode = TCP_SERVER; TCP servo mode;
 * S0_Mode = TCP_CLIENT; TCP client mode;    
 * S0_Mode = UDP_MODE; UDP broadcast mode;
**********************************************************************************/
unsigned char S0_Mode =3;	
/* TCP servo mode */
#define TCP_SERVER	0x00
/* TCP client mode */
#define TCP_CLIENT	0x01
/* UDP broadcast mode */
#define UDP_MODE	0x02
/**********************************************************************************
 * S0_State, port 0 state
 * S0_State = S_INIT; port init finished;
 * S0_State = S_CONN; port connected finished;
**********************************************************************************/
unsigned char S0_State =0;	
/* port has been inited */
#define S_INIT		0x01	 
/* port has been connected */
#define S_CONN		0x02	 
/**********************************************************************************
 * S0_Data, port 0 data state
 * S0_Data = S_RECEIVE; port has received one data pack;
 * S0_Data = S_TRANSMITOK; port has sended one data pack;
**********************************************************************************/
unsigned char S0_Data;	
#define S_RECEIVE	 0x01	 
#define S_TRANSMITOK 0x02	 
/***************----- Data buffer area -----***************/
/* RX buffer area */
unsigned char Rx_Buffer[2048];	 
/* TX buffer area */
unsigned char Tx_Buffer[2048];	 
/**********************************************************************************
 * W5500 interrupt state flag 
 * W5500_Interrupt = 0; no interruption
 * W5500_Interrupt = 1; interruption happened
**********************************************************************************/
unsigned char W5500_Interrupt;
/*******************************************************************************
 * Funtion : W5500_GPIO_Configuration
 * Description : W5500 GPIO configuration
 * Input : None
 * Output : None
 * Return : None
 * Others : None
*******************************************************************************/
void W5500_GPIO_Configuration(void)
{
  GPIO_InitTypeDef  GPIO_InitStructure;
  EXTI_InitTypeDef   EXTI_InitStructure; 
  NVIC_InitTypeDef NVIC_InitStructure;

  /* Enable Port B clock */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
  /* W5500_INT_Pin Init */
  GPIO_InitStructure.GPIO_Pin = W5500_INT_Pin;
  GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	/* GPIO_Mode_IPU */ 
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN; 
	/* inner pull up */
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_Init(W5500_INT_PORT, &GPIO_InitStructure);
  /* W5500_RST_Pin Init */
  GPIO_InitStructure.GPIO_Pin  = W5500_RST_Pin;
  GPIO_InitStructure.GPIO_Speed=GPIO_Speed_25MHz;
	/* GPIO_Mode_Out_PP */
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	/* GPIO_Mode_Out_PP */
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	/* floating */
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(W5500_RST_PORT, &GPIO_InitStructure);
  GPIO_ResetBits(W5500_RST_PORT, W5500_RST_Pin);
  /* W5500_SCS_Pin Init */
  GPIO_InitStructure.GPIO_Pin  = W5500_SCS_Pin;
  GPIO_InitStructure.GPIO_Speed=GPIO_Speed_25MHz;
	/* GPIO_Mode_Out_PP */
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	/* GPIO_Mode_Out_PP */
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	/* floating */
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(W5500_RST_PORT, &GPIO_InitStructure);
  GPIO_ResetBits(W5500_SCS_PORT, W5500_SCS_Pin);
	/* EXTI configuration */
  /* for EXTI, must enable RCC_APB2Periph_SYSCFG */
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);
  /* Connect EXTI Line4 to PC4 */
  SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOC, GPIO_PinSource4);
  /* PC4 as W5500 interrupt input */
  EXTI_InitStructure.EXTI_Line = EXTI_Line4;
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
	/* falling edge trigger interrupt */
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure);
  /* NVIC Configuration */
  NVIC_InitStructure.NVIC_IRQChannel = EXTI4_IRQn; 
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x02; 
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x02; 
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE; 
  NVIC_Init(&NVIC_InitStructure);
	/* must configure these two steps when using uC/OS-III */
	/* binding EXTI4 to function EXTI4_IRQHandler*/
  BSP_IntVectSet(BSP_INT_ID_EXTI4, EXTI4_IRQHandler);
	/* enable interruption of ucos iii */
  BSP_IntEn(BSP_INT_ID_EXTI4);
}

/*******************************************************************************
 * Funtion : SPI_Configuration
 * Description : SPI GPIO and AF function configuration
 * Input : None
 * Output : None
 * Return : None
 * Others : None
*******************************************************************************/
void SPI_Configuration(void)
{
	SPI_InitTypeDef  SPI_InitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;
	/* SPI GPIO configuration */
	/* enable AHB1 of port B*/
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
	/* pin selection */
	GPIO_InitStructure.GPIO_Pin = W5500_SPI_CLK_Pin |W5500_SPI_MISO_Pin | W5500_SPI_MOSI_Pin;
	/* push pull output, for better power perfomance */
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	/* inner pull down */
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_DOWN;
	/* AF mode*/	
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	/* GPIO operation speed */
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	/* enable selected GPIO to SPI2 AF function */
	GPIO_PinAFConfig(GPIOB,GPIO_PinSource13,GPIO_AF_SPI2);  
	GPIO_PinAFConfig(GPIOB,GPIO_PinSource14,GPIO_AF_SPI2);
	GPIO_PinAFConfig(GPIOB,GPIO_PinSource15,GPIO_AF_SPI2);
	/* SPI function configuration */
	/* enable SPI2's clk */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2,ENABLE); 
	/* SPI running mode */
	SPI_InitStructure.SPI_Direction=SPI_Direction_2Lines_FullDuplex;
	/* make this SPI, master mode */
	SPI_InitStructure.SPI_Mode=SPI_Mode_Master;
	SPI_InitStructure.SPI_DataSize=SPI_DataSize_8b;		
	/* CLK low when do nothing */				
	SPI_InitStructure.SPI_CPOL=SPI_CPOL_Low; 
	/* extra data at the first CLK edge */
	SPI_InitStructure.SPI_CPHA=SPI_CPHA_1Edge;						
	SPI_InitStructure.SPI_NSS=SPI_NSS_Soft;							
	/* baudarate */
	SPI_InitStructure.SPI_BaudRatePrescaler=SPI_BaudRatePrescaler_2;
	SPI_InitStructure.SPI_FirstBit=SPI_FirstBit_MSB;				
	SPI_InitStructure.SPI_CRCPolynomial=7;							
	SPI_Init(SPI2,&SPI_InitStructure);							
	SPI_Cmd(SPI2,ENABLE);	
}
/*******************************************************************************
 * Funtion : SPI2_Send_Byte
 * Description : SPI2 send one byte 
 * Input : None
 * Output : None
 * Return : None
 * Others : None
*******************************************************************************/
void SPI2_Send_Byte(unsigned char dat)
{
	SPI_I2S_SendData(SPI_SEL,dat);
	while(SPI_I2S_GetFlagStatus(SPI_SEL, SPI_I2S_FLAG_TXE) == RESET);
}
/*******************************************************************************
 * Funtion : Load_Net_Parameters
 * Description : net work parameter setting
 * Input : None
 * Output : None
 * Return : None
 * Others : None
*******************************************************************************/
void Load_Net_Parameters(void)
{
	/* gateway IP address */
	Gateway_IP[0] = 192;
	Gateway_IP[1] = 168;
	Gateway_IP[2] = 15;
	Gateway_IP[3] = 1;
	/* sub mask IP */
	Sub_Mask[0]=255;
	Sub_Mask[1]=255;
	Sub_Mask[2]=255;
	Sub_Mask[3]=0;
	/* MAC address */
	Phy_Addr[0]=0x0c;
	Phy_Addr[1]=0x29;
	Phy_Addr[2]=0xab;
	Phy_Addr[3]=0x7c;
	Phy_Addr[4]=0x00;
	Phy_Addr[5]=0x01;
	/* self IP address */
	IP_Addr[0]=192;
	IP_Addr[1]=168;
	IP_Addr[2]=15;
	IP_Addr[3]=3;
	/* port 0, port number. 0x1388 = 0d5000*/
	S0_Port[0] = 0x13;
	S0_Port[1] = 0x88;
	/* port 0, destination IP address */
	S0_DIP[0]=192;
	S0_DIP[1]=168;
	S0_DIP[2]=15;
	S0_DIP[3]=100;
	/* port 0, destination port number. 0x1770 = 0d6000 */
	S0_DPort[0] = 0x17;
	S0_DPort[1] = 0x70;
	/* port 0, operation mode. TCP client mode */
	S0_Mode = TCP_CLIENT;
}
/*******************************************************************************
 * Funtion : W5500_Initialization
 * Description : Init W5500
 * Input : None
 * Output : None
 * Return : None
 * Others : None
*******************************************************************************/
void W5500_Initialization(void)
{
	/* Init all register of W5500 */
	W5500_Init();	
	/* Check gateway connection */
	Detect_Gateway();	
	/* init the selected port, socket 0 */ 
	Socket_Init(0);	
}
/*******************************************************************************
 * Funtion : W5500_Init
 * Description : Init W5500's register 
 * Input : None
 * Output : None
 * Return : None
 * Others : None
*******************************************************************************/
void W5500_Init(void)
{
	OS_ERR  err;
	u8 i=0;
	/* soft-reset of W5500, set 1 enable, after the reset of W5500, register auto reset 0 */
	Write_W5500_1Byte(MR, RST);
	/* delay 10ms */
	OSTimeDlyHMSM(0u, 0u, 0u, 10u,
                OS_OPT_TIME_HMSM_STRICT,
                &err);
	/* set gateway IP, for access other net, such as Internet */
	Write_W5500_nByte(GAR, Gateway_IP, 4);			
	/* set sub net mask */
	Write_W5500_nByte(SUBR,Sub_Mask,4);			
	/* set MAC address, follow IEEE standard, for self-defination, the first byte must be odd number */
	Write_W5500_nByte(SHAR,Phy_Addr,6);		
	/* set self IP address, must make the IP belongs to the sub-net */
	/* for example, the forehead three bytes of gateway and IP must agree */
	Write_W5500_nByte(SIPR,IP_Addr,4);		
	/* Set socket 0~7 TX buffer and RX buffer to 2K, follow user guide of W5500 */
	for(i=0;i<8;i++)
	{
		/* RX buffer size of socket 0~7 */
		Write_W5500_SOCK_1Byte(i,Sn_RXBUF_SIZE, 0x02);
		/* TX buffer size of socket 0~7 */
		Write_W5500_SOCK_1Byte(i,Sn_TXBUF_SIZE, 0x02);
	}
	/* set reconnect timeout, bu default 200ms = 2000(0x07d0)*100us, 100us per ticket */
	Write_W5500_2Byte(RTR, 0x07d0);
	/* set reconnect times, by default 8. if times out, register Sn_IR TIMEOUT bit auto SET 1 */
	Write_W5500_1Byte(RCR,8);
	/* enable interrupt, refer to user guide of W5500, set intterrupt style */
	/* IMR_CONFLICT, IP conflict interrupt */
	/* IMR_UNREACH, address cannot access when using UDP mode */
	Write_W5500_1Byte(IMR,IM_IR7 | IM_IR6);
	Write_W5500_1Byte(SIMR,S0_IMR);
	Write_W5500_SOCK_1Byte(0, Sn_IMR, IMR_SENDOK | IMR_TIMEOUT | IMR_RECV | IMR_DISCON | IMR_CON);
}
/*******************************************************************************
 * Funtion : Write_W5500_1Byte
 * Description : write one byte to the selected registor of W5500
 * Input : reg, 16bit registor; dat, data;
 * Output : None
 * Return : None
 * Others : None
*******************************************************************************/
void Write_W5500_1Byte(unsigned short reg, unsigned char dat)
{
	/* reset pin SCS, enable W5500 */
	GPIO_ResetBits(W5500_SCS_PORT, W5500_SCS_Pin);
	/* use SPI send to the registor */
	SPI2_Send_Short(reg);
	/* write control word, 1 byte length */
	SPI2_Send_Byte(FDM1|RWB_WRITE|COMMON_R);
	/* write data */
	SPI2_Send_Byte(dat);
	/* set pin SCS, disable W5500 */
	GPIO_SetBits(W5500_SCS_PORT, W5500_SCS_Pin);
}
/*******************************************************************************
 * Funtion : Write_W5500_nByte
 * Description : write multi-byte to the selected registor of W5500
 * Input : reg, 16bit registor; *dat_ptr, data buffer ptr; size, data size;
 * Output : None
 * Return : None
 * Others : None
*******************************************************************************/
void Write_W5500_nByte(unsigned short reg, unsigned char *dat_ptr, unsigned short size)
{
	unsigned short i;
	/* reset pin SCS, enable W5500 */
	GPIO_ResetBits(W5500_SCS_PORT, W5500_SCS_Pin);
	/* use SPI send to the registor */	
	SPI2_Send_Short(reg);
	/* write control word, n byte length */
	SPI2_Send_Byte(VDM|RWB_WRITE|COMMON_R);
	/* write all data to W5500 */
	for(i=0;i<size;i++)
	{
		SPI2_Send_Byte(*dat_ptr++);
	}
	/* set pin SCS, disable W5500 */
	GPIO_SetBits(W5500_SCS_PORT, W5500_SCS_Pin);
}
/*******************************************************************************
 * Funtion : SPI2_Send_Short
 * Description : write 2-byte to the selected registor of W5500
 * Input : dat, data;
 * Output : None
 * Return : None
 * Others : None
*******************************************************************************/
void SPI2_Send_Short(unsigned short dat)
{
	/* MSB */
	SPI2_Send_Byte(dat/256);
	/* LSB */
	SPI2_Send_Byte(dat);
}
/*******************************************************************************
 * Funtion : Write_W5500_SOCK_1Byte
 * Description : write 1-byte to the selected socket of W5500
 * Input : s, socket port; reg, 16 bit registor address; dat, data;
 * Output : None
 * Return : None
 * Others : None
*******************************************************************************/
void Write_W5500_SOCK_1Byte(SOCKET s, unsigned short reg, unsigned char dat)
{
	/* reset pin SCS, enable W5500 */
	GPIO_ResetBits(W5500_SCS_PORT, W5500_SCS_Pin);
	/* 16 bit registro addr. */		
	SPI2_Send_Short(reg);
	/* control byte */
	SPI2_Send_Byte(FDM1|RWB_WRITE|(s*0x20+0x08));
	/* send data */
	SPI2_Send_Byte(dat);
	/* set pin SCS, disable W5500 */
	GPIO_SetBits(W5500_SCS_PORT, W5500_SCS_Pin); 
}
/*******************************************************************************
 * Funtion : Write_W5500_2Byte
 * Description : write 2-byte to the selected registor of W5500
 * Input : reg, 16 bit registor address; dat, data;
 * Output : None
 * Return : None
 * Others : None
*******************************************************************************/
void Write_W5500_2Byte(unsigned short reg, unsigned short dat)
{
	/* reset pin SCS, enable W5500 */
	GPIO_ResetBits(W5500_SCS_PORT, W5500_SCS_Pin);
	/* 16 bit registro addr. */	
	SPI2_Send_Short(reg);
	/* control byte */
	SPI2_Send_Byte(FDM2|RWB_WRITE|COMMON_R);
	/* send data */
	SPI2_Send_Short(dat);
	/* set pin SCS, disable W5500 */
	GPIO_SetBits(W5500_SCS_PORT, W5500_SCS_Pin);
}
/*******************************************************************************
 * Funtion : Write_W5500_2Byte
 * Description : write 2-byte to the selected registor of W5500
 * Input : reg, 16 bit registor address; dat, data;
 * Output : None
 * Return : None
 * Others : None
*******************************************************************************/
# if 0
void SPI2_Send_Byte(unsigned char dat)
{
	SPI_I2S_SendData(SPI_SEL,dat);//д1���ֽ�����
	while(SPI_I2S_GetFlagStatus(SPI_SEL, SPI_I2S_FLAG_TXE) == RESET);//�ȴ����ݼĴ�����
}
#endif
/*******************************************************************************
 * Funtion : Detect_Gateway
 * Description : check gateway connection status
 * Input : None
 * Output : None
 * Return : None
 * Others : None
*******************************************************************************/
unsigned char Detect_Gateway(void)
{
	unsigned char ip_adde[4];
	OS_ERR  err;
	ip_adde[0]=IP_Addr[0]+1;
	ip_adde[1]=IP_Addr[1]+1;
	ip_adde[2]=IP_Addr[2]+1;
	ip_adde[3]=IP_Addr[3]+1;
	/* check gateway and gateway's MAC */
	/* write an IP differ from self IP to the destination IP by socket 0 */
	Write_W5500_SOCK_4Byte(0,Sn_DIPR,ip_adde);
	/* set socket working in TCP mode */
	Write_W5500_SOCK_1Byte(0,Sn_MR,MR_TCP);
	/* open socket 0 */
	Write_W5500_SOCK_1Byte(0,Sn_CR,OPEN);
	/* delay 5ms */	
  OSTimeDlyHMSM(0u, 0u, 0u, 5u,
                OS_OPT_TIME_HMSM_STRICT,
                &err);
	if(Read_W5500_SOCK_1Byte(0,Sn_SR) != SOCK_INIT)//���socket��ʧ��
	{
		/* open socket failed, close socket */
		Write_W5500_SOCK_1Byte(0,Sn_CR,CLOSE);
		return FALSE;
	}
	/* set socket 0 to connect state */
	Write_W5500_SOCK_1Byte(0,Sn_CR,CONNECT);				
	do
	{
		u8 j=0;
		/* read W5500 Interruption registor state */
		j=Read_W5500_SOCK_1Byte(0,Sn_IR);
		if(j!=0)
		{
			Write_W5500_SOCK_1Byte(0,Sn_IR,j);
		}		
		/* delay 5ms */
	  OSTimeDlyHMSM(0u, 0u, 0u, 5u,
                  OS_OPT_TIME_HMSM_STRICT,
                  &err);
		if((j&IR_TIMEOUT) == IR_TIMEOUT)
		{
			/* connect timeout */
			return FALSE;	
		}
		else if(Read_W5500_SOCK_1Byte(0,Sn_DHAR) != 0xff)
		{
			/* close socket 0 */
			Write_W5500_SOCK_1Byte(0,Sn_CR,CLOSE);
			return TRUE;							
		}
	}while(1);
}
/*******************************************************************************
 * Funtion : Write_W5500_SOCK_4Byte
 * Description : write 4 byte to the selected registor by selected socket
 * Input : s, socket port; reg, 16 bit registor; *dat_ptr, 4 byte data buffer ptr;
 * Output : None
 * Return : None
 * Others : None
*******************************************************************************/
void Write_W5500_SOCK_4Byte(SOCKET s, unsigned short reg, unsigned char *dat_ptr)
{
	/* enable W5500 */
	GPIO_ResetBits(W5500_SCS_PORT, W5500_SCS_Pin);
	/* select registor */			
	SPI2_Send_Short(reg);
	/* ctrl byte */
	SPI2_Send_Byte(FDM4|RWB_WRITE|(s*0x20+0x08));
	/* write 4 byte data */
	SPI2_Send_Byte(*dat_ptr++);
	SPI2_Send_Byte(*dat_ptr++);
	SPI2_Send_Byte(*dat_ptr++);
	SPI2_Send_Byte(*dat_ptr++);
	/* disable W5500 */
	GPIO_SetBits(W5500_SCS_PORT, W5500_SCS_Pin);
}
/*******************************************************************************
 * Funtion : Read_W5500_SOCK_1Byte
 * Description : write 1 byte to the selected registor by selected socket
 * Input : s, socket port; reg, 16 bit registor;
 * Output : None
 * Return : None
 * Others : None
*******************************************************************************/
unsigned char Read_W5500_SOCK_1Byte(SOCKET s, unsigned short reg)
{
	unsigned char rev_data;
	/* enable W5500 */
	GPIO_ResetBits(W5500_SCS_PORT, W5500_SCS_Pin);
	/* select registor */	
	SPI2_Send_Short(reg);
	/* ctrl byte */
	SPI2_Send_Byte(FDM1|RWB_READ|(s*0x20+0x08));
	rev_data = SPI_I2S_ReceiveData(SPI_SEL);
	/* write one test data */
	SPI2_Send_Byte(0x00);
	rev_data = SPI_I2S_ReceiveData(SPI_SEL);
	/* disable W55000 */
	GPIO_SetBits(W5500_SCS_PORT, W5500_SCS_Pin);
	return (rev_data);
}
/*******************************************************************************
 * Funtion : Socket_Init
 * Description : Init the selected socket port
 * Input : s, socket port; 
 * Output : None
 * Return : None
 * Others : None
*******************************************************************************/
void Socket_Init(SOCKET s)
{
	/* set piece length, refer to user guide of W5500 */
	Write_W5500_SOCK_2Byte(0, Sn_MSSR, 1460);
	switch(s)
	{
		case 0:
			/* setting of socket 0 */
			/* set socket 0's port number (self IP) */
			Write_W5500_SOCK_2Byte(0, Sn_PORT, S0_Port[0]*256+S0_Port[1]);
			/* set socket 0's port number (destination IP) */
			Write_W5500_SOCK_2Byte(0, Sn_DPORTR, S0_DPort[0]*256+S0_DPort[1]);
			/* set socket 0's destination IP */
			Write_W5500_SOCK_4Byte(0, Sn_DIPR, S0_DIP);	
			break;
		case 1:
			/* setting of socket 1 */
			break;
		case 2:
			break;
		case 3:
			break;
		case 4:
			break;
		case 5:
			break;
		case 6:
			break;
		case 7:
			break;
		default:
			break;
	}
}
/*******************************************************************************
* ������  : Write_W5500_SOCK_2Byte
* ����    : ͨ��SPI1��ָ���˿ڼĴ���д2���ֽ�����
* ����    : s:�˿ں�,reg:16λ�Ĵ�����ַ,dat:16λ��д�������(2���ֽ�)
* ���    : ��
* ����ֵ  : ��
* ˵��    : ��
*******************************************************************************/
void Write_W5500_SOCK_2Byte(SOCKET s, unsigned short reg, unsigned short dat)
{
	GPIO_ResetBits(W5500_SCS_PORT, W5500_SCS_Pin);//��W5500��SCSΪ�͵�ƽ
			
	SPI2_Send_Short(reg);//ͨ��SPI1д16λ�Ĵ�����ַ
	SPI2_Send_Byte(FDM2|RWB_WRITE|(s*0x20+0x08));//ͨ��SPI1д�����ֽ�,2���ֽ����ݳ���,д����,ѡ��˿�s�ļĴ���
	SPI2_Send_Short(dat);//д16λ����

	GPIO_SetBits(W5500_SCS_PORT, W5500_SCS_Pin); //��W5500��SCSΪ�ߵ�ƽ
}
/*******************************************************************************
* ������  : W5500_Hardware_Reset
* ����    : Ӳ����λW5500
* ����    : ��
* ���    : ��
* ����ֵ  : ��
* ˵��    : W5500�ĸ�λ���ű��ֵ͵�ƽ����500us����,������ΧW5500
*******************************************************************************/
void W5500_Hardware_Reset(void)
{
	OS_ERR  err;
	GPIO_ResetBits(W5500_RST_PORT, W5500_RST_Pin);//��λ��������
	//Delay(50);
	OSTimeDlyHMSM(0u, 0u, 0u, 50u,
					OS_OPT_TIME_HMSM_STRICT,
					&err);
	GPIO_SetBits(W5500_RST_PORT, W5500_RST_Pin);//��λ��������
	//Delay(200);
	OSTimeDlyHMSM(0u, 0u, 0u, 200u,
					OS_OPT_TIME_HMSM_STRICT,
					&err);
	while((Read_W5500_1Byte(PHYCFGR)&LINK)==0);//�ȴ���̫���������
}
/*******************************************************************************
* ������  : Read_W5500_1Byte
* ����    : ��W5500ָ����ַ�Ĵ�����1���ֽ�����
* ����    : reg:16λ�Ĵ�����ַ
* ���    : ��
* ����ֵ  : ��ȡ���Ĵ�����1���ֽ�����
* ˵��    : ��
*******************************************************************************/
unsigned char Read_W5500_1Byte(unsigned short reg)
{
	static unsigned char i;

	GPIO_ResetBits(W5500_SCS_PORT, W5500_SCS_Pin);//��W5500��SCSΪ�͵�ƽ
			
	SPI2_Send_Short(reg);//ͨ��SPI1д16λ�Ĵ�����ַ
	SPI2_Send_Byte(FDM1|RWB_READ|COMMON_R);//ͨ��SPI1д�����ֽ�,1���ֽ����ݳ���,������,ѡ��ͨ�üĴ���

	i=SPI_I2S_ReceiveData(SPI_SEL);
	SPI2_Send_Byte(0x00);//����һ��������
	i=SPI_I2S_ReceiveData(SPI_SEL);//��ȡ1���ֽ�����

